//======================================================================================
if(!"abc"  in window){
	var abc = 10;
}
console.log(abc);   	        //undefined  

//因为先变量声明提升 所以提升之后abc的值系统默认会赋值为undefined。 !abc为false ,in是检查对象中是否存在某个属性。
//很显然 false属于是一个布尔类型。不存在对象中。所以没有走if里面的变量赋值。

if("abc"  in window){
	var abc = 10;
}
console.log(abc);   	        //10 

//因为变量提升，所以“abc”是window的一个属性，if判断为true，则abc被赋值10，所以最后输出10。

//======================================================================================
console.log(a);                 //undefined
if(!("a" in window)){
    var a = 10;
}
console.log(a);                 //undefined
//因为先变量声明提升 所以提升之后a的值系统默认会赋值为undefined。 变量提升会存在GO中也就是window。
//所以("a" in window)肯定为true。!去反一下就为false。所以不走赋值。

//======================================================================================